---
kind: other
id: Methods.T:Autodesk.Revit.UI.ExternalApplicationArray
source: html/73602556-f031-c1c3-76f0-03ea45642ca3.htm
---
# ExternalApplicationArray Methods

Add the item to the end of the array.